{
  "cv_text": "INSANIA CINDY PUAN FADILAHSARI +6281326000416 | insanniaacindy@gmail.com | linkedin.com/in/insaniacindy | github.com/insanniaa I am a 3rd-year Information Technology student at Brawijaya University with hands-on experience in data analysis, data engineering, machine learning, and data visualization through various campus projects and online courses. I am passionate about transforming raw data into meaningful insights, optimizing data processing workflows, and supporting decision-making processes with data-driven strategies. I am eager to apply my expertise in data analytics to help organizations make informed business decisions while gaining practical experience in the industry. Education Level Universitas Brawijaya Sep 2022 - Aug 2026 (Expected) Bachelor of Information Technology, 3.88/4.00 FILKOM Delegation Assigned to the 2023 UB LP2PKM. 3rd Winner of Scientific Writing Competition (PKM-PM) at Dekan Cup FILKOM UB 2022. Relevant Coursework: Statistics; Database Systems; Database Programming; Artificial Intelligence and Machine Learning; Data Science; Big Data and Analytics; Database Administration. Work Experiences ARTIKNESIA Feb 2025 - May 2025 Project Manager Intern Led 30+ strategic meetings, driving clear communication, efficient decision-making, and project alignment across teams. Designed BPMN (Business Process Model and Notation) for three main platforms: User, Artist, and Admin, streamlining process visualization and optimization. Developed comprehensive feature mapping for the User, Artist, and Admin platforms, ensuring clear functionality and seamless user experience. Successfully managed 8 tasks, ensuring on-time delivery and strict compliance with quality benchmarks. Supervised the Product Division, aligning product development with the CTO's strategic goals and directives. ID/X Partners x Rakamin Academic Mar 2024 - Apr 2024 Data Scientist Intern Successfully completed the ID/X Partners Data Scientist Project-Based Internship Program as a qualified participant, demonstrating strong performance and commitment. Achieved significant milestones during the program, including completing 3 task exams and successfully building a predictive model for credit risk assessment and loss rate estimation using the XGBoost (Extreme Gradient Boosting) algorithm. Organisational Experience LPM DISPLAY FILKOM UB Mar 2023 - Nov 2023 Staff of Human Resource Development Division Successfully spearheaded the launch event for Display Magazine's 11th edition, taking charge of planning, organizing, executing, compiling the magazine, and coordinating 20 products for a single issue. Masterfully led the 2023 Journal Display event as Master of Ceremonies, ensuring a seamless event flow and captivating an audience of 20+ attendees. KBMDSI FILKOM UB Mar 2023 - Nov 2023 Staff of Social Creative Department Led the Hari Berbatik initiative by conceptualizing and executing 4 engaging video contents and organizing 3 impactful activities. Successfully developed creative video concepts, wrote scripts, and edited videos to reach a wide audience. Efficiently managed the finances of Saling Berbagi 2023 and Career Visit 2023, overseeing budget planning, expense tracking, and preparing detailed financial reports with transparency, successfully managing over 7 million rupiah. Directed fundraising efforts and managed the distribution of donations for Peduli Bersama, ensuring efficient allocation and a meaningful impact on those in need. GEMASTIK XVI - Malang, Indonesia Aug 2023 - Sep 2023 Staff of Public Relations Collaborated with the team as the primary liaison between the competition committee and 10 animation teams, streamlining communication and ensuring seamless coordination of activities to contribute to the division's overall success. Dhamysoga Campus Expo 2022 - Malang, Indonesia Dec 2022 - Jan 2023Staff of Event Division Collaborated with the team to create detailed rundowns, select event speakers/performers, and develop the technical aspects of the event, ensuring seamless execution and a successful outcome. Coordinated with other divisions to streamline processes, successfully engaging 500+ participants and 13 speakers. KBMTI FILKOM UB Oct 2022 - Dec 2022 Intern Staff Served as a committee member in the PEMILTANG TI 2022 event, contributing to the event division by creating detailed rundowns, designing an effective voting concept, and developing technical aspects for seamless execution and successful event outcomes. Skills, Achievements & Other Experience Projects (2025): ETL Pipeline Project. Projects (2025): Fruit and Vegetable Image Classification. Projects (2025): Sentiment Analysis of the DANA Application Reviews on Google Play Store. Projects (2025): Machine Learning Project - Clustering and Classification. Projects (2024): Design and Implementation of a Database System using DB2: Development of Database Objects, Backup, Recovery, and High Availability. Projects (2024): Neural Collaborative Filtering (NCF) Model for Enhanced Sales and Customer Satisfaction Projects (2024): Development of an E-Commerce Recommendation System Using the Alternating Least Squares (ALS) Model with PySpark. Projects (2024): Credit Risk Prediction and Loss Estimation with XGBoost. Projects (2024): E-Commerce Performance and Customer Insights Analysis. Projects (2023): Web Implementation and Database Programming using SmartCodeIgniter. Projects (2023): Database Design and Implementation Using CDM, PDM, and SQL Stored Procedures. Projects (2023): Database Design and Implementation: ERD, Relational Model, DDL, and DML. Course (2025): Dicoding : Belajar Fundamental Pemrosesan Data. Course (2025): Dicoding : Belajar Pengembangan Machine Learning. Course (2025): Dicoding : Belajar Machine Learning untuk Pemula. Course (2025): Dicoding : Belajar Dasar Git dengan GitHub. Course (2025): Dicoding : Pengenalan ke Logika Pemrograman (Programming Logic 101). Course (2025): Dicoding : Memulai Dasar Pemrograman untuk Menjadi Pengembang Software. Course (2024): Dicoding : Belajar Dasar AI. Course (2024): Dicoding : Belajar Analisis Data dengan Python. Course (2024): Dicoding : Belajar Dasar Visualisasi Data. Course (2024): Dicoding : Belajar Dasar Data Science. Course (2024): Dicoding : Belajar Dasar Structured Query Language (SQL). Course (2024): Dicoding : Memulai Pemrograman dengan Python. Course (2024): My Skill Data Analysis : Fullstack Intensive Bootcamp. Course (2024): Oracle : Database Programming with SQL. Course (2024): Oracle : Database Design Achievements (2023): 2nd Winner of Creative Video Competition at 4C National Competition 2023. Achievements (2023): FILKOM Delegation Assigned to the 2023 UB LP2PKM. Achievements (2022): 3rd Winner of Scientific Writing Competition (PKM-PM) at Dekan Cup FILKOM UB 2022. Soft Skills: Leadership, Teamwork and Collaboration, Strategic Planning, Public Speaking, Problem-Solving, Time Management. Hard Skills: ETL (Expert), Data Analysis (Expert), Data Visualization (Expert), Statistical Analysis (Expert), Data Mining (Expert), Big Data (Expert), Data Modeling (Expert), Predictive Modeling (Intermediate), Machine Learning (Intermediate), Deep Learning (Basic). Programming Language: Java (Expert), Python (Expert), PHP (Basic), JavaScript (Basic). Markup Language: HTML (Expert), CSS (Expert), XML (Basic). Query Language: SQL (Intermediate). Tools: Visual Studio Code (Expert), Microsoft Word (Expert), Google Colaboratory (Expert), Canva (Expert), MySQL (Intermediate), Anaconda (Intermediate), DB2 (Intermediate), IBM Data Studio (Intermediate), Streamlit (Intermediate), Figma (Intermediate), Microsoft Excel (Intermediate), Tableau (Basic).",
  "analysis_results": {
    "overall_score": 79.41,
    "skills_analysis": {
      "matched_skills": [
        ["python", 1.0],
        ["java", 1.0],
        ["sql", 1.0],
        ["machine learning", 1.0],
        ["data analysis", 1.0]
      ],
      "missing_skills": [],
      "skill_match_percentage": 100.0
    }
  },
  "top_n": 6
}
